test/result/output-10p-4/statistics.json
{
  "list-service" : {
    "transaction" : "list-service",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.8600000000000001,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 3.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 3.0,
    "throughput" : 123.15270935960591,
    "receivedKBytesPerSec" : 39.68788485221675,
    "sentKBytesPerSec" : 22.008736145320196
  },
  "add-student-service" : {
    "transaction" : "add-student-service",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 206.59000000000003,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 2113.0,
    "pct1ResTime" : 1826.6000000000115,
    "pct2ResTime" : 2053.1,
    "pct3ResTime" : 2112.81,
    "throughput" : 34.638032559750606,
    "receivedKBytesPerSec" : 6.52845730862487,
    "sentKBytesPerSec" : 10.181687305161066
  },
  "ping" : {
    "transaction" : "ping",
    "sampleCount" : 3000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7.527666666666638,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 2104.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 4.0,
    "throughput" : 593.589236248516,
    "receivedKBytesPerSec" : 90.42961020973486,
    "sentKBytesPerSec" : 89.84993322121092
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 6300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 10.108095238095263,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 2113.0,
    "pct1ResTime" : 7.0,
    "pct2ResTime" : 11.0,
    "pct3ResTime" : 47.97999999999956,
    "throughput" : 1246.0443037974685,
    "receivedKBytesPerSec" : 206.78556418117088,
    "sentKBytesPerSec" : 236.00904247428798
  },
  "query-teacher" : {
    "transaction" : "query-teacher",
    "sampleCount" : 3000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6.756666666666654,
    "medianResTime" : 4.0,
    "minResTime" : 2.0,
    "maxResTime" : 123.0,
    "pct1ResTime" : 11.0,
    "pct2ResTime" : 19.0,
    "pct3ResTime" : 68.0,
    "throughput" : 1006.7114093959733,
    "receivedKBytesPerSec" : 174.01164010067114,
    "sentKBytesPerSec" : 222.18435402684563
  },
  "add-teacher-service" : {
    "transaction" : "add-teacher-service",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.8300000000000001,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 3.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 2.989999999999995,
    "throughput" : 123.15270935960591,
    "receivedKBytesPerSec" : 23.211399322660096,
    "sentKBytesPerSec" : 36.68122690886699
  }
}