test/result/output-10p-better-3/statistics.json
{
  "list-service" : {
    "transaction" : "list-service",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.6300000000000001,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 2.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.9899999999999949,
    "throughput" : 126.26262626262627,
    "receivedKBytesPerSec" : 40.690104166666664,
    "sentKBytesPerSec" : 22.56451231060606
  },
  "add-student-service" : {
    "transaction" : "add-student-service",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 204.99000000000004,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 2068.0,
    "pct1ResTime" : 1828.9000000000115,
    "pct2ResTime" : 2041.0,
    "pct3ResTime" : 2067.92,
    "throughput" : 34.952813701502976,
    "receivedKBytesPerSec" : 6.58778617616218,
    "sentKBytesPerSec" : 10.274215746242572
  },
  "ping" : {
    "transaction" : "ping",
    "sampleCount" : 100000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.5814399999999847,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 2068.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 6323.110970597534,
    "receivedKBytesPerSec" : 963.2864369269681,
    "sentKBytesPerSec" : 957.1115238697439
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 200300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.8204543185222185,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 2068.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 3.0,
    "throughput" : 12665.191274106859,
    "receivedKBytesPerSec" : 2060.667285804616,
    "sentKBytesPerSec" : 2357.5138812045525
  },
  "query-teacher" : {
    "transaction" : "query-teacher",
    "sampleCount" : 100000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.8556199999999997,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 18.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 5.0,
    "throughput" : 7275.372862859222,
    "receivedKBytesPerSec" : 1257.5595671153146,
    "sentKBytesPerSec" : 1605.6975263732268
  },
  "add-teacher-service" : {
    "transaction" : "add-teacher-service",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.6899999999999996,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 2.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 2.0,
    "throughput" : 126.26262626262627,
    "receivedKBytesPerSec" : 23.79754577020202,
    "sentKBytesPerSec" : 37.60752051767677
  }
}